Revit 2026 API

# PathOfTravelUpdate Method

---

Updates the path of travel by recalculating the path between the original start and end points.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PathOfTravelCalculationStatus Update()
```
```vb
Public Function Update As PathOfTravelCalculationStatus
```
```cpp
public:
PathOfTravelCalculationStatus Update()
```
```fsharp
member Update : unit -> PathOfTravelCalculationStatus
```

#### Return Value

PathOfTravelCalculationStatus The status result of the recalculation.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This functionality is not available in Revit LT. |

If recalculation results in failure, Revit will post a warning.

#### Reference

PathOfTravel Class

Autodesk.Revit.DB.Analysis Namespace